CREATE DATABASE EmployeeManagementDB4;
GO

USE EmployeeManagementDB4;
GO

CREATE TABLE Departments (
    department_id INT IDENTITY(1,1) NOT NULL,
    department_name VARCHAR(100) NOT NULL,
    PRIMARY KEY (department_id)
);
GO

CREATE TABLE Employees (
    employee_id INT IDENTITY(1,1) NOT NULL,
    first_name nVARCHAR(50) NOT NULL,
    last_name nVARCHAR(50) NOT NULL,
	phone nVARCHAR(50),
    department_id INT NOT NULL,
    hire_date DATE NOT NULL,
    salaryPerHour DECIMAL(10, 2),
	boss_id int,
	status int
    PRIMARY KEY (employee_id),
    FOREIGN KEY (department_id) REFERENCES Departments(department_id),
	FOREIGN KEY (boss_id) REFERENCES Employees(employee_id)
);
GO

CREATE TABLE Projects (
    project_id INT IDENTITY(1,1) NOT NULL,
    project_name nVARCHAR(20) NOT NULL,
	description nVARCHAR(50),
    start_date DATE,
    end_date DATE
    
    PRIMARY KEY (project_id)
);
GO

CREATE TABLE EmployeeProjects (
    employee_id INT NOT NULL,
    project_id INT NOT NULL,
	work_date date,
    hours_worked INT,
	paid bit 
    PRIMARY KEY (employee_id, project_id,work_date),
    FOREIGN KEY (employee_id) REFERENCES Employees(employee_id),
    FOREIGN KEY (project_id) REFERENCES Projects(project_id)

);
GO

CREATE TABLE Salaries (
    salary_id INT IDENTITY(1,1) NOT NULL,
    employee_id INT NOT NULL,
    amount DECIMAL(10, 2) NOT NULL,
	bonus DECIMAL(10, 2),
	salary_date DATE NOT NULL,
    PRIMARY KEY (salary_id),
    FOREIGN KEY (employee_id) REFERENCES Employees(employee_id)
);
GO

INSERT INTO Departments (department_name) VALUES
('מחלקת הייטק'),
('מחלקת פיתוח'),
('מחלקת מכירות'),
('מחלקת שיווק'),
('מחלקת שירות לקוחות'),
('מחלקת לוגיסטיקה'),
('מחלקת IT'),
('מחלקת משאבי אנוש'),
('מחלקת כספים'),
('NULL'); 

INSERT INTO Projects (project_name, description, start_date, end_date) VALUES
('פרויקט א', 'תכנון מוצר חדיש', '2023-01-01', '2023-06-01'),
('פרויקט ב', 'בדיקת התכנון', '2023-02-01', '2023-07-01'),
('פרויקט ג', 'מוצר מספר 2', '2023-03-01', '2023-08-01'),
('פרויקט ד', 'בדיקת התכנון 2', '2023-04-01', '2023-09-01'), 
('פרויקט ה', 'מוצר מספר 3', '2023-05-01', '2023-10-01'),
('פרויקט ו', 'העברת שרת', '2023-06-01', '2023-11-01'),
('פרויקט ז', 'הגדרות חדשות', '2023-07-01', '2023-12-01'),
('פרויקט ח', 'שלב מתקדם', '2023-08-01', null),
('פרויקט ט', 'פיתוח', '2023-09-01', null),
('פרויקט י', 'NULL', '2023-10-01', null);  



INSERT INTO Employees (first_name, last_name, phone, department_id, hire_date, salaryPerHour, boss_id, status) VALUES
('יוסי', 'כהן', '050-4134567', 1, '2023-01-01', 50.00, NULL, 1)
go
INSERT INTO Employees (first_name, last_name, phone, department_id, hire_date, salaryPerHour, boss_id, status) VALUES
('שרה', 'לוי', '050-4134567', 2, '2023-01-15', 55.00,1, 1)
go
INSERT INTO Employees (first_name, last_name, phone, department_id, hire_date, salaryPerHour, boss_id, status) VALUES
('דוד', 'פישמן', '058-3234567', 3, '2023-02-01', NULL, NULL, 1), 
('מרים', 'אולייר', '058-3234567', 4, '2023-02-15', 70.00, 2, 1),
('אבי', 'גז', '050-4134567', 5, '2023-03-01', 60.00, NULL, 1)
go
INSERT INTO Employees (first_name, last_name, phone, department_id, hire_date, salaryPerHour, boss_id, status) VALUES
('אורה', 'ישראל', '050-4134567', 1, '2023-03-15', 65.00, 2, 1),
('מאיר', 'ברק', '052-7134567', 2, '2023-04-01', 55.00, 1, 1),
('יעקב', 'שושני', '054-8464567', 2, '2023-04-15', 75.00, 1, 1),  
('הדר', 'שיין', '055-6734567', 3, '2023-05-01', 58.00, 1, NULL),  
('עמיחי', 'רוז', '052-7145678', 4, '2023-05-15', 72.00, 1, 1),
('אבי', 'שקולניק', '055-6745678', 5, '2023-06-01', 60.00, 1, 1),
('שלמה', 'דיין', '052-7145678', 1, '2023-06-15', 80.00, 1, 1),
('מאיר', 'שמעוני', '052-7145678', 1, '2023-07-01', NULL, 1, 1), 
('דינה', 'פינקלשטיין', '054-8445678', 2, '2023-07-15', 64.00, 2, 1),
('חיים', 'שטרן', '055-6745678', 2, '2023-08-01', 66.00, 1, 1),
('רינה', 'זיו', '050-6245678', 3, '2023-08-15', 90.00, NULL, 1),  
('נועה', 'אייזנברג', '055-6745678', 4, '2023-09-01', 55.00, 1 ,1),
('נפתלי', 'כהן', '052-7145678', 5, '2023-09-15', 55.00, 4, 1),
('אורי', 'שלייפר', '054-8445678', 1, '2023-10-01', NULL, 1, 1),  
('נעמי', 'כהן', '054-8445678', 1, '2023-10-15', 73.00, 2, 1),
('יהודה', 'דוד', '052-7145678', 2, '2023-11-01', 65.00, 1, 1),
('גד', 'לוי', '050-2345678', 3, '2023-11-15', 50.00, NULL, 1),  
('דן', 'פלאי', '054-8445678', 4, '2023-12-01', 80.00, 3, 1),
('שמעון', 'רם', '052-7145678', 5, '2023-12-15', 62.00, 2, 1),
('דוד', 'אדר', '053-3145678', 1, '2023-01-01', 52.00, 5, 1),
('משה', 'צור', '054-8445678', 2, '2023-02-01', NULL, NULL, 1),  
('אילה', 'שקדי', '054-8445678', 3, '2023-03-01', 58.00, 2, 2),
('שני', 'מזרחי', '054-8445678', 4, '2023-04-01', 44.00, 3, 1),
('רוני', 'לוי', '050-9345678', 5, '2023-05-01', 90.00, NULL, 1), 
('ראובן', 'וייס', '050-4156789', 1, '2023-06-01', 78.00, 5, 1),
('אורי', 'קורן', '053-3156789', 2, '2023-07-01', 63.00, 5, 1),
('לאה', 'ברס', '050-2456789', 3, '2023-08-01', 141.00, 2, 2),  
('אלי', 'שיינר', '053-3156789', 4, '2023-09-01', 79.00, null, 1),
('צבי', 'חכמון', '050-4456789', 5, '2023-10-01', NULL, 5, 1);  

go
INSERT INTO EmployeeProjects (employee_id, project_id, work_date, hours_worked, paid) VALUES
(1, 1, '2023-01-10', 8, 1),
(1, 2, '2023-01-11', 6, 0),
(2, 1, '2023-01-12', 7, 1),
(3, 1, '2023-01-13', 8, 0),
(4, 2, '2023-01-14', 5, 1),
(5, 2, '2023-01-15', 4, 1),
(6, 5, '2023-01-16', 6, 0),  
(7, 1, '2023-01-17', 8, 1),
(8, 2, '2023-01-18', 7, 1),
(9, 1, '2023-01-19', NULL, 1),  
(10, 2, '2023-01-20', 6, 0),
(11, 1, '2023-01-21', 7, 1),
(12, 2, '2023-01-22', 5, NULL), 
(13, 2, '2023-01-23', 8, 0),
(14, 1, '2023-01-24', 7, 1),
(15, 2, '2023-01-25', 6, 1),
(16, 1, '2023-01-26', 5, 1),
(17, 2, '2023-01-27', 4, 0),
(18, 1, '2023-01-28', 8, 1),
(19, 6, '2023-01-29', 7, 1),  
(20, 2, '2023-01-30', 6, 1),
(21, 7, '2023-02-01', 5, 1),
(22, 2, '2023-02-02', 8, 1),
(23, 1, '2023-02-03', 7, NULL),  
(24, 9, '2023-02-04', 6, 0),
(25, 1, '2023-02-05', 4, 1),
(26, 8, '2023-02-06', 7, 1),
(27, 1, '2023-02-07', 8, 0),
(28, 2, '2023-02-08', 5, 1),
(29, 8, '2023-02-09', 7, 1),
(30, 2, '2023-02-10', 6, 0),
(31, 1, '2023-02-11', 4, 1),
(32, 2, '2023-02-12', 8, 1),
(33, 9, '2023-02-13', 7, 1),
(34, 10, '2023-02-14', 6, NULL);
INSERT INTO EmployeeProjects (employee_id, project_id, work_date, hours_worked, paid) VALUES
(1, 1, '2024-01-10', 8, 1),
(1, 2, '2024-01-11', 6, 0),
(2, 4, '2024-01-12', 7, 1),
(3, 4, '2024-01-13', 8, 0),
(4, 5, '2024-01-14', 5, 1),
(5, 6, '2024-01-15', 4, 1),
(6, 6, '2024-01-16', 6, 0),  
(7, 5, '2024-01-17', 8, 1),
(8, 1, '2024-01-18', 7, 1),
(9, 1, '2024-01-19', NULL, 1),  
(10, 6, '2024-01-20', 6, 0),
(11, 4, '2023-01-21', 7, 1),
(12, 6, '2024-01-22', 5, NULL), 
(13, 6, '2024-01-23', 8, 0),
(14, 6, '2024-01-24', 7, 1),
(15, 6, '2024-01-25', 6, 1),
(16, 4, '2024-01-26', 5, 1),
(17, 6, '2023-01-27', 4, 0),
(18, 4, '2023-01-28', 8, 1),
(19, 7, '2024-01-29', 7, 1),  
(20, 4, '2024-01-30', 6, 1),
(21, 9, '2024-02-01', 5, 1),
(22, 9, '2025-02-02', 8, 1),
(23, 10, '2024-02-03', 7, NULL),  
(24, 6, '2024-02-04', 6, 0),
(25, 7, '2024-02-05', 4, 1),
(26, 7, '2024-02-06', 7, 1),
(27, 7, '2024-02-07', 8, 0),
(28, 8, '2024-02-08', 5, 1),
(29, 8, '2024-02-09', 7, 1),
(30, 9, '2024-02-10', 6, 0),
(31, 9, '2024-02-11', 4, 1),
(32, 10, '2024-02-12', 8, 1),
(33, 9, '2024-02-13', 7, 1),
(34, 10, '2024-02-14', 6, NULL);


